app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "created_at", "updated_at", "email", "password") VALUES (?, ?, ?, ?, ?)  [["name", "a@a.a"], ["created_at", "2018-06-20 22:25:02.112794"], ["updated_at", "2018-06-20 22:25:02.112794"], ["email", "a@a.a"], ["password", "a"]]
---
  def create
    @customer = Customer.new(customer_params)


    respond_to do |format|
      if @customer.save