app/controllers/pages_controller.rb

SELECT "pizzas".* FROM "pizzas"
---
  def home
  @pizzas = Pizza.all