app/controllers/pages_controller.rb

SELECT "recipes".* FROM "recipes"
---
  def home
  @recipes = Recipe.all