app/controllers/pizzas_controller.rb

SELECT "pizzas".* FROM "pizzas"
---
  def index
    @pizzas = Pizza.all

SELECT "crusts".* FROM "crusts"
SELECT "recipes".* FROM "recipes"
---
  def new
    @pizza = Pizza.new
    @crust = Crust.all
    @recipie = Recipe.all

SELECT "crusts".* FROM "crusts"
SELECT "recipes".* FROM "recipes"
INSERT INTO "pizzas" ("created_at", "updated_at", "crust_id", "recipe_id", "name") VALUES (?, ?, ?, ?, ?)  [["created_at", "2018-06-20 22:44:54.510601"], ["updated_at", "2018-06-20 22:44:54.510601"], ["crust_id", 1], ["recipe_id", 3], ["name", "asd"]]
---
  def create
    @pizza = Pizza.new(pizza_params)
    @crust = Crust.all
    @recipie = Recipe.all

    respond_to do |format|
      if @pizza.save

DELETE FROM "pizzas" WHERE "pizzas"."id" = ?  [["id", 1]]
---
  def destroy
    @pizza.destroy

SELECT  "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_pizza
      @pizza = Pizza.find(params[:id])