app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("price", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?)  [["price", 11], ["created_at", "2018-06-20 22:44:42.019970"], ["updated_at", "2018-06-20 22:44:42.019970"], ["name", "asd"]]
---
  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save