app/controllers/sessions_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."email" = ? LIMIT ?  [["email", "peres@gmail.com"], ["LIMIT", 1]]
---
  def create
    user = Customer.find_by(email: params[:session][:email].downcase)